## DataBase Handling

###  # SQLite

In [122]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('employee.db')
c=conn.cursor()

In [84]:
c.execute('DROP TABLE employees')

In [85]:
c.execute('''CREATE TABLE employees(
          ID int,
          FIRST str,
          LAST str,
          SALARY int
         )''')
conn.commit()

In [86]:
c.execute("INSERT INTO employees VALUES (01,'Sylvester', 'Fernandes', 50000)")
c.execute("INSERT INTO employees VALUES (02,'Yogendra', 'Singh', 70000)")
c.execute("INSERT INTO employees VALUES (03,'Rohit', 'Mishra', 30000)")
c.execute("INSERT INTO employees VALUES (04,'Kunal', 'Vaid', 30000)")
c.execute("INSERT INTO employees VALUES (05,'Devendra', 'Shekhawat', 30000)")
conn.commit()

In [91]:
c.execute('SELECT * FROM employees')
conn.commit()
print(c.fetchone(),'\n')
print(c.fetchone(),'\n')

(1, 'Sylvester', 'Fernandes', 50000)

(2, 'Yogendra', 'Singh', 70000)

In [92]:
print(c.fetchmany(2),'\n')

[(3, 'Rohit', 'Mishra', 30000), (4, 'Kunal', 'Vaid', 30000)]

In [93]:
print(c.fetchall())                # because cursor was at row 4

[(5, 'Devendra', 'Shekhawat', 30000)]

In [72]:
conn.close()                   # closing coneection to database

In [73]:
c.fetchone()                   # gives error because conection iss closed before

ProgrammingError: Cannot operate on a closed database.

### handson with SQLite

In [94]:
conn = sqlite3.connect('db_University')

In [96]:
c=conn.cursor()

In [104]:
c.execute('DROP TABLE student_data')
conn.commit()

OperationalError: no such table: student_data

In [105]:
c.execute('''create table student_data(
          Student_Name str,
          Student_Age int,
          Student_Roll_No int,
          Student_Branch str
            )''')
conn.commit()

In [106]:
c.execute("INSERT INTO student_data VALUES('Yogi',21, 1234, 'CSE')")
conn.commit()

In [120]:
c.execute('SELECT * FROM student_data')
conn.commit()

In [121]:
print(c.fetchall())

[('Yogi', 21, 1234, 'CSE')]

In [137]:
conn.close()

In [161]:
conn1 = sqlite3.connect('My_Database')
c1=conn1.cursor()

In [162]:
c1.execute("""CREATE TABLE Icc_Ranking(
          Rank int ,
          Team str,
          Matches int,
          Points int,
          Rating int 
          )""")
conn1.commit()

OperationalError: table Icc_Ranking already exists

In [157]:
df=pd.read_csv('icc_men_ranking.csv')
df

    Unnamed: 0  Rank              Team  Matches Points  Rating
0            0     1           England       54  6,745     125
1            1     2             India       64  7,748     121
2            2     3       New Zealand       43  4,837     112
3            3     4      South Africa       47  5,193     110
4            4     5         Australia       53  5,854     110
5            5     6          Pakistan       51  5,019      98
6            6     7        Bangladesh       46  3,963      86
7            7     8         Sri Lanka       56  4,520      81
8            8     9       West Indies       57  4,573      80
9            9    10       Afghanistan       43  2,440      57
10          10    11           Ireland       31  1,525      49
11          11    12          Zimbabwe       35  1,538      44
12          12    13       Netherlands        6    222      37
13          13    14          Scotland       18    537      30
14          14    15     United States       12    299      25
15          15    16              Oman       10    199      20
16          16    17             Nepal        8    152      19
17          17    18           Namibia       11    177      16
18          18    19               UAE       21    285      14
19          19    20  Papua New Guinea       17      0       0

In [178]:
df1=df.iloc[:,1:]
df1

    Rank              Team  Matches Points  Rating
0      1           England       54  6,745     125
1      2             India       64  7,748     121
2      3       New Zealand       43  4,837     112
3      4      South Africa       47  5,193     110
4      5         Australia       53  5,854     110
5      6          Pakistan       51  5,019      98
6      7        Bangladesh       46  3,963      86
7      8         Sri Lanka       56  4,520      81
8      9       West Indies       57  4,573      80
9     10       Afghanistan       43  2,440      57
10    11           Ireland       31  1,525      49
11    12          Zimbabwe       35  1,538      44
12    13       Netherlands        6    222      37
13    14          Scotland       18    537      30
14    15     United States       12    299      25
15    16              Oman       10    199      20
16    17             Nepal        8    152      19
17    18           Namibia       11    177      16
18    19               UAE       21    285      14
19    20  Papua New Guinea       17      0       0

In [191]:
df1.to_sql('Icc_Ranking', conn1, if_exists='replace',index=False)   # dataframe to database

In [192]:
c1.execute('SELECT * FROM Icc_Ranking')
conn1.commit()
c1.fetchall()

[(1, 'England', 54, '6,745', 125),
 (2, 'India', 64, '7,748', 121),
 (3, 'New Zealand', 43, '4,837', 112),
 (4, 'South Africa', 47, '5,193', 110),
 (5, 'Australia', 53, '5,854', 110),
 (6, 'Pakistan', 51, '5,019', 98),
 (7, 'Bangladesh', 46, '3,963', 86),
 (8, 'Sri Lanka', 56, '4,520', 81),
 (9, 'West Indies', 57, '4,573', 80),
 (10, 'Afghanistan', 43, '2,440', 57),
 (11, 'Ireland', 31, '1,525', 49),
 (12, 'Zimbabwe', 35, '1,538', 44),
 (13, 'Netherlands', 6, '222', 37),
 (14, 'Scotland', 18, '537', 30),
 (15, 'United States', 12, '299', 25),
 (16, 'Oman', 10, '199', 20),
 (17, 'Nepal', 8, '152', 19),
 (18, 'Namibia', 11, '177', 16),
 (19, 'UAE', 21, '285', 14),
 (20, 'Papua New Guinea', 17, '0', 0)]

In [199]:
df2=pd.read_sql_query('SELECT * FROM Icc_Ranking',conn1)      # database to dataframe
df2

    Rank              Team  Matches Points  Rating
0      1           England       54  6,745     125
1      2             India       64  7,748     121
2      3       New Zealand       43  4,837     112
3      4      South Africa       47  5,193     110
4      5         Australia       53  5,854     110
5      6          Pakistan       51  5,019      98
6      7        Bangladesh       46  3,963      86
7      8         Sri Lanka       56  4,520      81
8      9       West Indies       57  4,573      80
9     10       Afghanistan       43  2,440      57
10    11           Ireland       31  1,525      49
11    12          Zimbabwe       35  1,538      44
12    13       Netherlands        6    222      37
13    14          Scotland       18    537      30
14    15     United States       12    299      25
15    16              Oman       10    199      20
16    17             Nepal        8    152      19
17    18           Namibia       11    177      16
18    19               UAE       21    285      14
19    20  Papua New Guinea       17      0       0

In [202]:
conn1.close()

### MySql

In [201]:
import mysql.connector

In [209]:
conn = mysql.connector.connect ( user='root', password='yogi', host='localhost')  # use database too for particular database

In [215]:
c = conn.cursor()
c.execute('CREATE DATABASE  IF NOT EXISTS MyDatabase')
c.execute('USE MyDatabase')

In [296]:
c.execute("DROP TABLE IF EXISTS employees")
conn.commit()

In [297]:
c.execute ("""CREATE TABLE employees(
          id INTEGER,
          first  TEXT,
          last TEXT,
          pay INTEGER
          )""")
conn.commit()

In [298]:
c.execute("INSERT INTO employees VALUES (01,'Sylvester', 'Fernandes', 50000)")
c.execute("INSERT INTO employees VALUES (02,'Yogendra', 'Singh', 70000)")
c.execute("INSERT INTO employees VALUES (03,'Rohit', 'Mishra', 30000)")
c.execute("INSERT INTO employees VALUES (04,'Kunal', 'Vaid', 30000)")
c.execute("INSERT INTO employees VALUES (05,'Devendra', 'Shekhawat', 30000)")
c.execute("INSERT INTO employees VALUES (06,'Yogendra', 'Kumar', 170000)")
conn.commit()

In [299]:
c.execute("SELECT * FROM employees")

In [300]:
c.fetchall()

[(1, 'Sylvester', 'Fernandes', 50000),
 (2, 'Yogendra', 'Singh', 70000),
 (3, 'Rohit', 'Mishra', 30000),
 (4, 'Kunal', 'Vaid', 30000),
 (5, 'Devendra', 'Shekhawat', 30000),
 (6, 'Yogendra', 'Kumar', 170000)]

In [303]:
df2=pd.read_sql_query('SELECT * FROM employees',conn)      # database to dataframe
df2

   id      first       last     pay
0   1  Sylvester  Fernandes   50000
1   2   Yogendra      Singh   70000
2   3      Rohit     Mishra   30000
3   4      Kunal       Vaid   30000
4   5   Devendra  Shekhawat   30000
5   6   Yogendra      Kumar  170000

In [3]:
import re
list1=[]
for i in range(3):
    list1.append(input("enter :"))
print(sorted(re.findall('[a-z0-9-_]+\@[a-z]+\.[a-z]{2,}',' '.join(list1))) )

enter :yogendra12@gmail.com
enter :mohit_12@gmail.com
enter :ajeet1324@gmail.com
['ajeet1324@gmail.com', 'mohit_12@gmail.com', 'yogendra12@gmail.com']

### MongoDB

In [22]:
from pymongo import MongoClient
client = MongoClient('localhost', 27019)

In [23]:
MyDatabase = client.employees

In [24]:
def add_employee(idd, first, last, pay):
    unique_employee = MyDatabase.employees.find_one({"id":idd})
    if unique_employee:
        return "Employee already exists"
    else:
        MyDatabase.employees.insert(
                {
                "id" : idd,
                "first" : first,
                "last" : last,
                "pay" : pay
                })
        return "Employee added successfully"
def fetch_all_employee():
    user = MyDatabase.employees.find()
    for i in user:
        print (i)

In [25]:
add_employee(1,'Sylvester', 'Fernandes', 50000)
add_employee(2,'Yogendra', 'Singh', 70000)
add_employee(3,'Rohit', 'Mishra', 30000)
add_employee(4,'Kunal', 'Vaid', 30000)
add_employee(5,'Devendra', 'Shekhawat', 30000)

ServerSelectionTimeoutError: localhost:27019: [WinError 10061] No connection could be made because the target machine actively refused it